#pragma once

DEFINE_COMMAND_PLUGIN(InitMiniMap, , 0, 0, NULL);
DEFINE_COMMAND_PLUGIN(UpdateMiniMap, , 0, 2, kParams_OneInt_OneOptionalInt);

#define CACHED_TEXTURES_MAX 60
#define CACHED_TEXTURES_MIN 42

Tile::Value *s_miniMapScale, *s_localMapZoom;
BSScissorTriShape *s_localMapShapes[9];
NiTriShapeData *s_localMapShapeDatas[9];
UInt32 s_texturePixelSize = 0x110;

__declspec(naked) void UpdateTileScales()
{
	__asm
	{
		mov		eax, s_localMapZoom
		movss	xmm0, [eax+8]
		movss	xmm1, kFltHalf
		addss	xmm1, xmm0
		mov		eax, s_miniMapScale
		mulss	xmm1, [eax+8]
		mov		ecx, offset s_localMapShapes
		movd	edx, xmm1
		mov		eax, [ecx]
		mov		[eax+0x64], edx
		mov		eax, [ecx+4]
		mov		[eax+0x64], edx
		mov		eax, [ecx+8]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0xC]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0x10]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0x14]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0x18]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0x1C]
		mov		[eax+0x64], edx
		mov		eax, [ecx+0x20]
		mov		[eax+0x64], edx
		mulss	xmm0, kFlt10
		cvttss2si	eax, xmm0
		shl		eax, 4
		add		eax, 0x70
		mov		s_texturePixelSize, eax
		retn
	}
}

float s_cellNorthRotation = 0;
__m128 s_northRotationMods = {0, 1, -1, 0};

__declspec(naked) void __fastcall AdjustInteriorPos(TESObjectREFR *refr, NiPoint2 *outPos)
{
	static const __m128 kIntrPosMods = {2048, 2048, 0, 0};
	__asm
	{
		movq	xmm0, qword ptr [ecx+0x30]
		cmp		s_cellNorthRotation, 0
		jz		noRotation
		unpcklps	xmm0, xmm0
		mulps	xmm0, s_northRotationMods
		pxor	xmm1, xmm1
		movhlps	xmm1, xmm0
		addps	xmm0, xmm1
	noRotation:
		subps	xmm0, kIntrPosMods
		movq	qword ptr [edx], xmm0
		retn
	}
}

struct WorldDimensions
{
	float		minX;		// 00
	float		minY;		// 04
	float		sizeX;		// 08
	float		sizeY;		// 0C
}
s_rootWorldDimensions;

__declspec(naked) void __fastcall GetWorldDimensions(TESWorldSpace *worldSpc)
{
	__asm
	{
		add		ecx, 0x80
		movsx	eax, word ptr [ecx+0xC]
		inc		eax
		movsx	edx, word ptr [ecx+8]
		sub		eax, edx
		shl		edx, 0xC
		cvtsi2ss	xmm0, edx
		shl		eax, 0xC
		cvtsi2ss	xmm1, eax
		mov		edx, 0x3F4C0000
		movd	xmm2, edx
		divss	xmm1, xmm2
		movsx	eax, word ptr [ecx+0xE]
		movsx	edx, word ptr [ecx+0xA]
		mov		ecx, offset s_rootWorldDimensions
		movss	[ecx], xmm0
		movss	[ecx+8], xmm1
		inc		edx
		sub		eax, edx
		shl		edx, 0xC
		cvtsi2ss	xmm0, edx
		shl		eax, 0xC
		cvtsi2ss	xmm1, eax
		divss	xmm1, xmm2
		movss	[ecx+4], xmm0
		movss	[ecx+0xC], xmm1
		retn
	}
}

struct WorldPosMods
{
	float		mapScale;	// 00
	float		mapCellX;	// 04
	float		mapCellY;	// 08
	float		posModX;	// 0C
	float		posModY;	// 10
}
s_currWorldPosMods;

__declspec(naked) void __fastcall GetWorldPosMods(TESWorldSpace *worldSpc)
{
	__asm
	{
		add		ecx, 0x90
		mov		eax, offset s_currWorldPosMods
		movdqu	xmm0, xmmword ptr [ecx]
		movdqu	xmmword ptr [eax], xmm0
		cmp		dword ptr [ecx], 0x3F800000
		jz		done
		movss	xmm0, kFltHalf
		movss	xmm1, [ecx]
		mulss	xmm1, xmm0
		subss	xmm0, xmm1
		movss	xmm1, [ecx+0x10]
		addss	xmm1, [ecx+0x18]
		mulss	xmm1, xmm0
		addss	xmm1, [ecx+4]
		movss	[eax+0xC], xmm1
		movss	xmm1, [ecx+0x14]
		addss	xmm1, [ecx+0x1C]
		mulss	xmm1, xmm0
		addss	xmm1, [ecx+8]
		movss	[eax+0x10], xmm1
	done:
		retn
	}
}

__declspec(naked) void __fastcall AdjustWorldPos(TESObjectREFR *refr, NiPoint2 *outMults)
{
	__asm
	{
		movq	xmm0, qword ptr [ecx+0x30]
		mov		eax, offset s_currWorldPosMods
		mov		ecx, [eax]
		cmp		ecx, 0x3F800000
		jz		noScale
		movd	xmm1, ecx
		movsldup	xmm1, xmm1
		mulps	xmm0, xmm1
		movq	xmm1, qword ptr [eax+0xC]
		jmp		done
	noScale:
