#pragma once

DEFINE_COMMAND_PLUGIN(InitMiniMap, , 0, 0, NULL);
DEFINE_COMMAND_PLUGIN(UpdateMiniMap, , 0, 2, kParams_OneInt_OneOptionalInt);

#define CACHED_TEXTURES_MAX			60
#define CACHED_TEXTURES_PURGED		40
#define QUEST_TARGETS_POS_UPD_FREQ	5

__declspec(naked) NiTriangle *GenerateTriangles()
{
	__asm
	{
		push	0xC00
		mov		eax, 0xAA13E0
		call	eax
		pop		ecx
		mov		ecx, eax
		push	eax
		push	ebx
		xor		ah, ah
		xor		dx, dx
	iter1Head:
		xor		al, al
		mov		bl, ah
		and		bl, 1
	iter2Head:
		mov		bh, al
		and		bh, 1
		cmp		bl, bh
		mov		bx, dx
		jz		invDir
		mov		[ecx+2], bx
		inc		bx
		mov		[ecx+4], bx
		mov		[ecx+6], bx
		add		bx, 0x10
		mov		[ecx], bx
		mov		[ecx+0xA], bx
		inc		bx
		mov		[ecx+8], bx
		jmp		iter2Next
	invDir:
		mov		[ecx+4], bx
		mov		[ecx+6], bx
		inc		bx
		mov		[ecx+8], bx
		add		bx, 0x10
		mov		[ecx+2], bx
		inc		bx
		mov		[ecx], bx
		mov		[ecx+0xA], bx
	iter2Next:
		add		ecx, 0xC
		inc		dx
		inc		al
		cmp		al, 0x10
		jb		iter2Head
		inc		dx
		inc		ah
		cmp		ah, 0x10
		jb		iter1Head
		pop		ebx
		pop		eax
		retn
	}
}

Tile::Value *s_miniMapScale, *s_localMapZoom;
BSScissorTriShape *s_localMapShapes[9];
UInt32 s_texturePixelSize = 0x110;

__declspec(naked) void UpdateTileScales()
{
	__asm
	{
		mov		eax, s_localMapZoom
		movss	xmm0, [eax+8]
		addss	xmm0, kFltHalf
		mov		eax, s_miniMapScale
		mulss	xmm0, [eax+8]
		mov		edx, 9
	iterHead:
		dec		edx
		mov		eax, s_localMapShapes[edx*4]
		movss	[eax+0x64], xmm0
		jnz		iterHead
		mov		eax, s_localMapZoom
		movss	xmm0, [eax+8]
		mulss	xmm0, kFlt10
		cvttss2si	eax, xmm0
		imul	eax, 0x10
		add		eax, 0x70
		mov		s_texturePixelSize, eax
		retn
	}
}

float s_cellNorthRotation = 0, s_northRotationVector[] = {1, 0, 0, 1};

__declspec(naked) void __fastcall GetNorthRotation(TESObjectCELL *cell)
{
	__asm
	{
		test	byte ptr [ecx+0x24], 1
		jz		noRotation
		push	kExtraData_NorthRotation
		add		ecx, 0x28
		call	GetExtraData
		test	eax, eax
		jz		noRotation
		fld		dword ptr [eax+0xC]
		fchs
		fst		s_cellNorthRotation
		mov		eax, offset s_northRotationVector
		fsincos
		fst		dword ptr [eax]
		fstp	dword ptr [eax+0xC]
		fst		dword ptr [eax+4]
		fchs
		fstp	dword ptr [eax+8]
		retn
	noRotation:
		mov		s_cellNorthRotation, 0
		retn
	}
}

__declspec(naked) void __fastcall AdjustInteriorPos(CoordXY *inPos, CoordXY *outPos)
{
	__asm
	{
		cmp		s_cellNorthRotation, 0
		jz		noRotation
		mov		eax, offset s_northRotationVector
		movss	xmm0, [ecx]
		mulss	xmm0, [eax]
		movss	xmm1, [ecx+4]
		mulss	xmm1, [eax+8]
		addss	xmm0, xmm1
		movss	xmm1, [ecx]
		mulss	xmm1, [eax+4]
		movss	xmm2, [ecx+4]
		mulss	xmm2, [eax+0xC]
		addss	xmm1, xmm2
		jmp		done
	noRotation:
		movss	xmm0, [ecx]
		movss	xmm1, [ecx+4]
	done:
		subss	xmm0, kFlt2048
		subss	xmm1, kFlt2048
		movss	[edx], xmm0
		movss	[edx+4], xmm1
		retn
	}
}

__declspec(naked) UInt32 __fastcall GetInteriorCoord(CoordXY *adjustedPos)
{
	__asm
	{
		cvttss2si	eax, [ecx]
		sar		eax, 0xC
		shl		eax, 0x10
		cvttss2si	ecx, [ecx+4]
		sar		ecx, 0xC
		mov		ax, cx
		retn
	}
}

struct WorldDimensions
{
	float		minX;		// 00
	float		minY;		// 04
	float		sizeX;		// 08
	float		sizeY;		// 0C
}
s_rootWorldDimensions;

__declspec(naked) void __fastcall GetWorldDimensions(TESWorldSpace *worldSpc)
{
	static const float kSizeDivisor = 0.796875F;
	__asm
	{
		add		ecx, 0x80
		movsx	eax, word ptr [ecx+0xC]
		inc		eax
		movsx	edx, word ptr [ecx+8]
		sub		eax, edx
		shl		edx, 0xC
		cvtsi2ss	xmm0, edx
		shl		eax, 0xC
		cvtsi2ss	xmm1, eax
		divss	xmm1, kSizeDivisor
		movsx	eax, word ptr [ecx+0xE]
		movsx	edx, word ptr [ecx+0xA]
		mov		ecx, offset s_rootWorldDimensions
		movss	[ecx], xmm0
		movss	[ecx+8], xmm1
		inc		edx
		sub		eax, edx
		shl		edx, 0xC
		cvtsi2ss	xmm0, edx
		shl		eax, 0xC
		cvtsi2ss	xmm1, eax
		divss	xmm1, kSizeDivisor
		movss	[ecx+4], xmm0
		movss	[ecx+0xC], xmm1
		retn
	}
}

struct WorldPosMods
{
	float		mapScale;	// 00
	float		mapCellX;	// 04
	float		mapCellY;	// 08
	float		posModX;	// 0C
	float		posModY;	// 10
}
s_currWorldPosMods;

__declspec(naked) void __fastcall GetWorldPosMods(TESWorldSpace *worldSpc)
{
	__asm
	{
		add		ecx, 0x90
		mov		eax, offset s_currWorldPosMods
		movdqu	xmm0, xmmword ptr [ecx]
		movdqu	xmmword ptr [eax], xmm0
		cmp		dword ptr [ecx], 0x3F800000
		jz		done
		movss	xmm0, kFltHalf
		movss	xmm1, [ecx]
		mulss	xmm1, xmm0
		subss	xmm0, xmm1
		movss	xmm1, [ecx+0x10]
		addss	xmm1, [ecx+0x18]
		mulss	xmm1, xmm0
		addss	xmm1, [ecx+4]
		movss	[eax+0xC], xmm1
		movss	xmm1, [ecx+0x14]
		addss	xmm1, [ecx+0x1C]
		mulss	xmm1, xmm0
		addss	xmm1, [ecx+8]
		movss	[eax+0x10], xmm1
	done:
		retn
	}
}

__declspec(naked) void __fastcall AdjustWorldPos(CoordXY *inPos, CoordXY *outMults)
{
	__asm
	{
		mov		eax, offset s_currWorldPosMods
		cmp		dword ptr [eax], 0x3F800000
		jz		noScale
		movss	xmm0, [ecx]
		mulss	xmm0, [eax]
		addss	xmm0, [eax+0xC]
		movss	xmm1, [ecx+4]
		mulss	xmm1, [eax]
		addss	xmm1, [eax+0x10]
		jmp		done
	noScale:
		movss	xmm0, [ecx]
