#include "internal/jip_core.h"

NVSEStringVarInterface g_stringVar;
NVSEArrayVarInterface g_arrayVar;
NVSECommandTableInterface g_commandTbl;
NVSEScriptInterface g_script;
NVSESerializationInterface g_serialization;
ExpressionEvaluatorUtils s_expEvalUtils;

_CaptureLambdaVars CaptureLambdaVars;
_UncaptureLambdaVars UncaptureLambdaVars;
_InventoryRefCreate InventoryRefCreate;
_InventoryRefGetForID InventoryRefGetForID;

DIHookControl *g_DIHookCtrl;

_UIOInjectComponent UIOInjectComponent = nullptr;

ModelLoader *g_modelLoader;
DataHandler *g_dataHandler;
LoadedReferenceCollection *g_loadedReferences;
InterfaceManager *g_interfaceManager;
OSGlobals *g_OSGlobals;
TES *g_TES;
Sky *g_currentSky;
PlayerCharacter *g_thePlayer;
NiCamera *g_mainCamera;
TaskQueueInterface *g_scrapHeapQueue;
FontManager *g_fontManager;
OSInputGlobals *g_inputGlobals;
TileMenu **g_tileMenuArray;
HUDMainMenu *g_HUDMainMenu;
ConsoleManager *g_consoleManager;
NiNode *s_pc1stPersonNode = nullptr, *g_cursorNode;
ShadowSceneNode *g_shadowSceneNode;
TESObjectREFR *s_tempPosMarker;
float g_screenWidth, g_screenHeight;
const char *g_terminalModelDefault;
TESObjectWEAP *g_fistsWeapon;
TESObjectACTI *g_ashPileACTI, *g_gooPileACTI;
TESGlobal *g_gameYear, *g_gameMonth, *g_gameDay, *g_gameHour, *g_timeScale;
TESObjectMISC *g_capsItem;
TESImageSpaceModifier *g_getHitIMOD, *g_explosionInFaceIMOD;
UInt32 s_mainThreadID, s_initialTickCount;

const bool kInventoryType[] =
{

__declspec(naked) UInt32 __fastcall GetResolvedRefID(UInt32 *refID)
{
	__asm
	{
		cmp		dword ptr [ecx], 0
		jz		retnArg
		movzx	eax, byte ptr [ecx+3]
		cmp		al, 0xFF
		jz		retnArg
		add		eax, g_BGSSaveLoadGame
		mov		dl, [eax+0x44]
		cmp		dl, 0xFF
		jz		retn0
		mov		[ecx+3], dl
	retnArg:
		mov		eax, [ecx]
		retn
	retn0:
		xor		eax, eax
		mov		[ecx], eax
		retn
	}
}

TempObject<UnorderedMap<const char*, UInt32>> s_strRefs;

UInt32 __fastcall StringToRef(char *refStr)
{
	UInt32 *findStr;
	if (!s_strRefs->InsertKey(refStr, &findStr)) return *findStr;
	*findStr = 0;
	char *colon = FindChr(refStr, ':');
	if (colon)
	{
		UInt8 modIdx;
		if (colon != refStr)
		{
			*colon = 0;
			modIdx = g_dataHandler->GetModIndex(refStr);
			*colon = ':';
			if (modIdx == 0xFF) return 0;
		}
		else modIdx = 0xFF;
		*findStr = (modIdx << 24) | HexToUInt(colon + 1);
		return *findStr;
	}
	*findStr = HexToUInt(refStr);
	return GetResolvedRefID(findStr);
}

__declspec(noinline) InventoryItemsMap *GetInventoryItemsMap()
{
	thread_local static TempObject<InventoryItemsMap> s_inventoryItemsMap;
	s_inventoryItemsMap->Clear();
	return *s_inventoryItemsMap;
}

bool GetInventoryItems(TESObjectREFR *refr, UInt8 typeID, InventoryItemsMap *invItemsMap)
{
	TESContainer *container = refr->baseForm->GetContainer();
	if (!container) return false;
	ContChangesEntryList *entryList = refr->GetContainerChangesList();
	if (!entryList) return false;

	TESContainer::FormCount *formCount;
	TESForm *item;
	SInt32 contCount, countDelta;
	ContChangesEntry *entry;

	auto contIter = container->formCountList.Head();
	do
	{
		if (!(formCount = contIter->data)) continue;
		item = formCount->form;
		if ((typeID && (item->typeID != typeID)) || (item->typeID == kFormType_TESLevItem) || invItemsMap->HasKey(item))
			continue;
		contCount = container->GetCountForForm(item);
		if (entry = entryList->FindForItem(item))
		{
			countDelta = entry->countDelta;
			if (entry->HasExtraLeveledItem())
				contCount = countDelta;
			else contCount += countDelta;
		}
		if (contCount > 0)
			invItemsMap->Emplace(item, contCount, entry);
	}
	while (contIter = contIter->next);

	auto xtraIter = entryList->Head();
	do
	{
		if (!(entry = xtraIter->data)) continue;
		item = entry->type;
		if ((typeID && (item->typeID != typeID)) || invItemsMap->HasKey(item))
			continue;
		countDelta = entry->countDelta;
		if (countDelta > 0)
			invItemsMap->Emplace(item, countDelta, entry);
	}
	while (xtraIter = xtraIter->next);

	return !invItemsMap->Empty();
}

__declspec(naked) void __fastcall ShowItemMessage(TESForm *item, const char *msgStr)
{
	__asm
	{
		push	ebp
		mov		ebp, esp
		push	edx
		call	TESForm::GetTheName
		cmp		[eax], 0
		jz		done
		sub		esp, 0x70
		mov		edx, eax
		lea		ecx, [ebp-0x74]
		call	StrCopy
		mov		[eax], ' '
		mov		edx, [ebp-4]
		lea		ecx, [eax+1]
		call	StrCopy
		mov		word ptr [eax], '.'
		push	0
		push	0x40000000
		push	0
		push	0x10208E0
		push	0
		lea		eax, [ebp-0x74]
		push	eax
		CALL_EAX(0x7052F0)
	done:
		leave
		retn
	}
}

struct RayCastData
{
	hkVector4	pos0;		// 00	
	hkVector4	pos1;		// 10
	UInt8		byte20;		// 20
	UInt8		pad21[3];	// 21
	UInt8		layerType;	// 24
	UInt8		filterFlags;// 25
	UInt16		group;		// 26
	UInt32		unk28[6];	// 28
	float		flt40;		// 40
	UInt32		unk44[15];	// 44
	hkCdBody	*cdBody;	// 80
	UInt32		unk84[3];	// 84
	hkVector4	vector90;	// 90
	UInt32		unkA0[3];	// A0
	UInt8		byteAC;		// AC
	UInt8		padAD[3];	// AD
};
static_assert(sizeof(RayCastData) == 0xB0);

__declspec(naked) NiAVObject* __fastcall _GetRayCastObject(RayCastData *rcData)
{
	__asm
	{
		push	ebx
		mov		ebx, ecx
		mov		eax, [ebp+0xC]
		mov		ecx, [ebp+8]
		movups	xmm0, [eax]
		shufps	xmm0, xmm0, 0xC
		movss	xmm1, [eax+0x18]
		unpcklpd	xmm0, xmm1
		movss	xmm1, [ebp+0x10]
		shufps	xmm1, xmm1, 0x40
		mulps	xmm0, xmm1
		movups	xmm1, [ecx]
		movaps	xmm2, kUnitConv
		mulps	xmm1, xmm2
		movaps	[ebx], xmm1
		mulps	xmm0, xmm2
		addps	xmm0, xmm1
		movaps	[ebx+0x10], xmm0
		mov		dword ptr [ebx+0x40], 0x3F800000
		or		eax, 0xFFFFFFFF
		mov		[ebx+0x44], eax
		mov		[ebx+0x50], eax
		xor		eax, eax
		mov		[ebx+0x20], al
		lea		ecx, [ebx+0x70]
		mov		[ecx], eax
		mov		[ecx+0x10], eax
		xorps	xmm0, xmm0
		movaps	[ecx+0x20], xmm0
		movaps	[ecx+0x30], xmm0
		mov		eax, g_thePlayer
		mov		ecx, [eax+0x68]
		mov		eax, [ecx+0x138]
		mov		ecx, [eax+0x594]
		mov		eax, [ecx+8]
		mov		ecx, [eax+0x2C]
		mov		eax, [ebp+0x14]
