#pragma once

__declspec(naked) void InitTopicInfoHook()
{
	__asm
	{
		xor		edx, edx
		mov		[ecx], edx
		mov		[ecx+4], edx
		mov		[ecx+0x38], edx
		retn
	}
}

__declspec(naked) void LoadTopicInfoHook()
{
	__asm
	{
		mov		eax, [esp+8]
		mov		[eax+0x50], ecx
		JMP_EAX(0x619820)
	}
}

__declspec(naked) void InvalidChargenQuestFixHook()
{
	__asm
	{
		cmp		dword ptr [ebp-0x10], 0
		jnz		done
		push	0x102037
		call	LookupFormByRefID
		mov		[ebp-0x10], eax
	done:
		JMP_EAX(0x7D3345)
	}
}

__declspec(naked) void GeneratePlayerNodeHook()
{
	__asm
	{
		push	0
		push	esp
		push	dword ptr ds:0x11CDD7C
		mov		eax, g_modelLoader
		mov		ecx, [eax]
		CALL_EAX(0x4493D0)
		pop		eax
		cmp		dword ptr [eax+8], 0
		jg		skipRefCount
		lock inc dword ptr [eax+8]
	skipRefCount:
		mov		ecx, [eax+0xC]
		call	NiAVObject::CreateCopy
		mov		[ebp-0x18], eax
		or		byte ptr [eax+0x32], 0x20
		mov		s_pc1stPersonNode, eax
		JMP_EAX(0x94E4D9)
	}
}

__declspec(naked) void __fastcall DoQueuedPlayerHook(QueuedPlayer *queuedPlayer)
{
	__asm
	{
		mov		eax, [ecx+0x28]
		test	byte ptr [eax+0x5F], kHookRefFlag5F_Update3D
		jnz		proceed
		jmp		DoQueuedReferenceHook
	proceed:
		push	ebx
		push	ecx
		mov		ebx, eax
		push	1
		push	0
		mov		ecx, ebx
		CALL_EAX(0x5702E0)
		mov		ecx, [ebx+0x68C]
		test	ecx, ecx
		jz		done68C
		push	1
		CALL_EAX(0x418E00)
		and		dword ptr [ebx+0x68C], 0
	done68C:
		mov		ecx, [ebx+0x690]
		test	ecx, ecx
		jz		done690
		push	1
		CALL_EAX(0x418D20)
		and		dword ptr [ebx+0x690], 0
	done690:

			if (!findEntry().refID || LookupFormByRefID(findEntry().refID) || !HasChangeData(findEntry().refID))
			{
				findEntry.Remove();
				s_dataChangedFlags |= kChangedFlag_ExtraData;
			}
	if (doFree)
		Game_HeapFree(xJIP);
}

bool __fastcall ExtraJIPDiffersHook(ExtraJIP *xJIP, int, BSExtraData *compareTo)
{
	if (xJIP->type == compareTo->type)
		if (ExtraJIPEntry *entry1 = s_extraDataKeysMap->GetPtr(xJIP->key))
			if (ExtraJIPEntry *entry2 = s_extraDataKeysMap->GetPtr(((ExtraJIP*)compareTo)->key))
				return !(*entry1 == *entry2);
	return true;
}

void __fastcall CopyExtraJIPEntry(ExtraJIPEntry *inEntry, UINT key)
{
	s_extraDataKeysMap()[key] = *inEntry;
}

__declspec(naked) void ExtraJIPCreateCopyHook()
{
	__asm
	{
		mov		edx, [ebp+8]
		push	dword ptr [edx+0xC]
		mov		ecx, offset s_extraDataKeysMap
		call	ExtraJIPEntryMap::GetPtr
		test	eax, eax
		jz		done
		mov		esi, eax
		or		s_dataChangedFlags, kChangedFlag_ExtraData
		push	kXData_ExtraJIP
		mov		ecx, [ebp-0x170]
		call	BaseExtraList::GetByType
		test	eax, eax
		jnz		hasXJIP
		push	0
		call	ExtraDataList::AddExtraJIP
	hasXJIP:
		mov		ecx, [ebp+4]
		mov		edx, [ebp]
		mov		dl, [edx+0xC]
		cmp		ecx, 0x412250
		jnz		notCont
		test	dl, dl
		jz		doSwap
	doCopy:
		mov		edx, [eax+0xC]
		test	edx, edx
		jnz		hasKey
		push	eax
		call	ExtraJIP::MakeKey
		pop		ecx
		mov		[ecx+0xC], eax
		mov		edx, eax
	hasKey:
		mov		ecx, esi
		call	CopyExtraJIPEntry
		jmp		done
	notCont:
		cmp		ecx, 0x412523
		jnz		doCopy
		test	dl, dl
		jz		doCopy
	doSwap:
		and		dword ptr [esi], 0
		mov		esi, [ebp+8]
		mov		ecx, [esi+0xC]
		mov		edx, [eax+0xC]
		mov		[esi+0xC], edx
		mov		[eax+0xC], ecx
	done:
		mov		ecx, [ebp-0xC]
		mov		fs:0, ecx
		pop		ecx
		pop		esi
		leave
		retn	4
	}
}

__declspec(naked) void ExtraJIPLoadGameHook()
{
	__asm
	{
		mov		eax, [ebp+8]
		mov		edx, [eax+4]
		add		edx, [eax+0xC]
		add		dword ptr [eax+0xC], 5
		mov		edx, [edx]
		test	edx, edx
		jz		done
		push	edx
		push	kXData_ExtraJIP
		mov		ecx, [ebp-0x5D4]
		call	BaseExtraList::GetByType
		test	eax, eax
		jnz		hasXJIP
		push	0x42C1C3
		jmp		ExtraDataList::AddExtraJIP
	hasXJIP:
		pop		ecx
		mov		edx, [eax+0xC]
		cmp		ecx, edx
		jz		done
		mov		[eax+0xC], ecx
		push	edx
		mov		ecx, offset s_extraDataKeysMap
		call	ExtraJIPEntryMap::Erase
	done:
		JMP_EAX(0x42C1C3)
	}
}

__declspec(naked) void ExtraJIPSaveGameHook()
{
	__asm
	{
		mov		edx, [ebp+8]
		mov		ecx, [ebp-0x20]
		push	0x427EB6
		jmp		ExtraJIP::SaveGame
	}
}

__declspec(naked) bool __fastcall GetShouldSaveUnloadedFormHook(BGSSaveLoadGame *slGame, int, TESForm *form)
{
	__asm
	{
		mov		ecx, [esp+4]
		test	byte ptr [ecx+9], 0x40
		jnz		retn0
		mov		eax, [ecx]
		cmp		dword ptr [eax+0xF0], ADDR_ReturnTrue
		jnz		retn1
		cmp		dword ptr [eax+0x224], ADDR_ReturnTrue
		jz		isProjectile
		cmp		byte ptr [ecx+0xF], 0xFF
		jnz		retn1
		test	byte ptr [ecx+0xA], 0x40
		jnz		retn0
	retn1:
		mov		al, 1
		retn	4
	retn0:
		xor		al, al
		retn	4
	isProjectile:
		call	dword ptr [eax+0x324]
		retn	4
	}
}

typedef Map<TESForm*, SInt32, 0x80> InventoryIterMap;

struct InventoryIterator
{
	TESContainer::FormCountList	*frmCountList;	// 00
	TESContainer::FormCountList	*frmCountIter;	// 04
	TESContainer::FormCountList	*baseFormList;	// 08
	ContChangesEntry			*outEntry;		// 0C
	TESContainer				*container;		// 10
	ContChangesEntryList		*entryListIter;	// 14
	UInt32						stage;			// 18
	UInt32						unk1C;			// 1C
	ContChangesExtraList		*extraList;		// 20
	UInt32						unk24;			// 24
	ContChangesEntryList		*baseEntryList;	// 28
	InventoryIterMap			deltasMap;		// 2C

	InventoryIterator() {}
};
static_assert(sizeof(InventoryIterator) == 0x38);

TempObject<InventoryIterator> s_inventoryIterator;

__declspec(naked) InventoryIterator* __fastcall CreateInventoryIteratorHook(ExtraContainerChanges::Data *xChangesData)
{
	__asm
	{
		push	esi
		mov		esi, offset s_inventoryIterator
		push	ecx
		mov		ecx, [esi]
		test	ecx, ecx
		jz		doneList
		push	ecx
		call	TESContainer::FormCountList::RemoveAll
		call	Game_HeapFree
	doneList:
		xorps	xmm0, xmm0
		movups	[esi], xmm0
		movups	[esi+0x10], xmm0
		movlps	[esi+0x20], xmm0
		pop		ecx
		mov		eax, [ecx]
		mov		[esi+0x28], eax
		and		dword ptr [esi+0x30], 0
		mov		eax, [ecx+4]
		test	eax, eax
		jz		noOwner
		mov		ecx, [eax+0x20]
		call	TESForm::GetContainer
		mov		[esi+0x10], eax
		mov		ecx, eax
		add		eax, 4
		mov		[esi+8], eax
		CALL_EAX(0x482B00)
		mov		[esi], eax
		mov		[esi+4], eax
	noOwner:
		mov		eax, esi
		pop		esi
		retn
	}
}

